# Angle2Str

## Description
Convert an angle value from a real number to a string using the current document formatting.

```pascal
FUNCTION Angle2Str(value : REAL) : STRING;
```

```python

def vs.Angle2Str(value):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|value|REAL|The angle value.|

## Version
Availability: from Vectorworks 2014
## Category
* Strings